[
    {
        "id": "1",
        "date": "",
        "title": "A timeline of the lawsuits Panera is facing over its Charged Lemonade",
        "subtitle": "While the chain has said goodbye to the caffeinated beverages, it still has a few outstanding legal troubles to deal with.",
        "description": "In early May, Panera Bread confirmed it was phasing out its Charged Lemonade, a buzzy line of caffeinated drinks at the center of lawsuits filed against the restaurant chain. The drinks first drew attention via influencer Sarah Baus, who posted a video on TikTok in late 2022 about her dining experience at Panera one afternoon. Baus claimed she unknowingly drank “four or five” highly-caffeinated Charged Lemonades. The TikToker assumed the drinks had a “normal amount of caffeine.” While Baus came out of her experience with millions of TikTok views, some others were not so fortunate, according to a suite of lawsuits hitting the bread-based chain. Panera’s souped-up refreshers contained 155 — 302 milligrams of caffeine (depending on serving size and flavor, according to Panera) skirting quite close to the FDA recommended limit of 400 milligrams per day. According to a Panera spokesperson at the time, the chain would be pivoting to low sugar and low-caffeine  offerings. The representative declined to comment on whether any of the lawsuits directly caused the drink’s discontinuation.",
        "image": "https://img.freepik.com/free-photo/burger-hamburger-cheeseburger_505751-3697.jpg?t=st=1717422963~exp=1717426563~hmac=8c9169c54501b81a2158692591d0f3900f564e0cd8bc050802171fdee38b45ea&w=740"
    },
    {
        "id": "2",
        "date": "",
        "title": "6 food and drink companies embracing florals for spring",
        "subtitle": "These items truly are groundbreaking..",
        "description": "These products make perfect gifts for someone who may expect more than a bouquet on a birthday or special occasion — they can now have their flowers and eat — or drink — them, too. From crackers and jams to sorbet and sparkling teas, these are the seasonal, plant-based indulgences that are currently trending. Upgrade that lousy peanut butter and jelly with a flower-infused jam. Featuring ingredient combos like gooseberry with elderflower, raspberry with wild bergamot, and rhubarb with dandelion and honey, Blake Hill’s award-winning concoctions will kick any ol’ jar to the curb — or at least to the bottom shelf on the pantry. These also make wonderful additions to thumbprint cookies, so enjoy in the spring but keep them in mind for winter. If you are what you eat, you’re certainly beautiful while noshing on one of these colorful crackers. Full of organically grown edible flowers and garden herbs, Flouwer Co.’s Instagram-worthy crisps make a lovely addition to charcuterie boards showing off the vibrancy and flavors of spring. Pair them with dips, cheeses and spreads or enjoy on their own with just the right amount of sea salt to complement the earthy notes.",
        "image": "https://img.freepik.com/free-photo/pizza-pizza-filled-with-tomatoes-salami-olives_140725-1200.jpg?t=st=1717422456~exp=1717426056~hmac=d1264fb0c81c07c1022b620f0221340e59ac72faf764aa3c9f815296e31740eb&w=740"
    },
    {
        "id": "3",
        "date": "",
        "title": "What is the true history of the California roll? The sushi has a fishy origin story",
        "subtitle": "While the chain has said goodbye to the caffeinated beverages, it still has a few outstanding legal troubles to deal with.",
        "description": "For many Americans, a California roll is their first foray into the world of sushi. Purists however have derided the fusion food as “not real sushi” — but to put it bluntly: the roll gets a bad wrap. The California roll as it’s known today is made with a few common ingredients: avocado, cucumber and crabmeat (or imitation crabmeat) which come wrapped in seaweed and sushi rice. Sometimes finished with sesame seeds, these ingredients make a roll that has become widespread. But where did it originally come from? Its history is a little murky: a few culinary minds have claimed credit for the West-influenced dish. Still, one thing is true: California rolls are here to stay. Who invented the California roll? The California roll’s origin is hotly contested, like the margarita, red beans and rice or many other foods with partially undocumented histories. And though the California roll has its naysayers due to its distinctly Americanized ingredients, the dish’s probable inventors responsible for the roll’s rise to fame, are in fact, all Japanese sushi chefs who conceived of it outside of the borders of Japan. It’s widely believed that sushi restaurants in the States first gained traction around the late 1960s with the opening of Kawafuku Restaurant in the Little Tokyo neighborhood of Los Angeles. From there, the raw fish-based dish spread across the country much like free love and flower power did, although the meat-and-cheese palette of most Americans at the time balked at the idea of consuming raw salmon and other fresh fish. In “American Tuna: The Rise and Fall of an Improbable Food,” author Andrew F. Smith posits two likely sources for the origin of the California roll. One is Ichiro Mashita, a Los Angeles-based sushi chef at a restaurant called Tokyo Kaikan.",
        "image": "https://img.freepik.com/premium-photo/asian-food-chinese-fried-rice_711483-63.jpg?w=740"
    },
    {
        "id": "4",
        "date": "",
        "title": "Jet Tila sometimes felt ‘confused’ about his Asian identity as a kid. Food helped him embrace it",
        "subtitle": "The chef’s new cooking show premieres July 1 on YouTube.",
        "description": "Walking into the backyard, it feels like entering a closed set of “The Kardashians” — except instead of the reality stars, chef Jet Tila is slinging barbecue. The celebrity chef is filming a new YouTube series in partnership with Coyote Outdoor at his Calabasas, California, home. Amid the gorgeous backdrop of his recently renovated outdoor kitchen and built-in TV set, Tila is deftly whipping up meaty dishes for the camera. His wife, Allison “Ali” Tila, is helping him bake bread in their outdoor oven for the segment. Though Tila attended French culinary school in his early 20s, there is no pretense of fussy tweezing or judgment here as he cheerfully prepares his dishes. “A comfort meal for me is cooking a burger,” Tila tells TODAY.com between takes. He adds making pizza and pasta for the couple’s two kids — who are nine and 12 years old — to the comfort-food lineup. Tila says he makes pizza at least once a week, adding with a laugh that “as a dad, I buy dough.” Much like Ina Garten, he agrees store-bought is fine. “Straight up, man,” he chuckles. “But at least we’re cooking with the kids! We’re having community around our kitchen. That kitchen community is one that has long shaped his family. His Thai Chinese parents were some of the earliest trailblazers to bring Thai food to America in the 1970s. The history isn’t lost on Tila, who says Chinese cuisine is more of a “legacy food” in the U.S. — since it’s been here for hundreds of years — but that Thai food is a more recent import. The chef says he’s been working as an ambassador for Thai culture his entire career. “You know you’re making an impact when every non-Asian chef is incorporating Asian flavors into their menu,” he says, adding that he’s “proud to be a spokesperson” for some Asian cultures.",
        "image": "https://img.freepik.com/premium-photo/bowl-food-with-food-flying-air_197463-2404.jpg?w=740"
    },
    {
        "id": "5",
        "date": "",
        "title": "How to clean gas, electric and glass stovetops, according to an expert",
        "subtitle": "Whether it's gas, electric or glass, it takes more than a halfhearted promise to really clean a messy stovetop in one day.",
        "description": "We asked Marla Mock, president of Molly Maid, to share her expert tips for this kitchen chore. She always recommends cleaning up immediately after cooking before spills and splatters harden, but we know that's not always possible. So she shared her best tips for tackling different types of stovetops to get them looking new again. For electric stovetops, start by removing the heating coils and grease catchers. For gas stovetops, start by removing metal grills and cover the gas heating element so nothing gets in there while cleaning. You can let these soak in the sink with hot water and dish soap while you clean everything else. Next, mix lemon juice and white vinegar in a spray bottle and spray it on the grease/grime. Allow it to sit for 10 minutes before scrubbing with a damp towel/cloth. Usually this will be enough for grease stains. However, if the grease is still there after you scrubbed, sprinkle some baking soda over the grease. Allow the baking soda to sit for five minutes before using another damp cloth or scrub sponge to get rid of the grease. The best cleaners for your stovetops are items you probably have around your house to begin with like baking soda, white vinegar, lemon juice, water and dish soap. Warning: Some people use white eraser sponges for extremely tough burn marks. These do work, but it's preferred that you use with caution as this substance is like microfine sandpaper and can scratch the surface if you’re not careful.",
        "image": "https://img.freepik.com/free-photo/set-bread-greens-salad-delicious-soup-meal-bowl-with-village-background-high-angle-view_176474-3815.jpg?t=st=1717423323~exp=1717426923~hmac=7c2e0c32be37578bc6afdae5a746cafc453aaa7a2895ec75015b4e33234a3abc&w=740"
    },
    {
        "id": "6",
        "date": "",
        "title": "Slow-Cooker White Chicken Chili",
        "subtitle": "It can't get any easier than a recipe that requires tossing everything into a slow cooker and letting the wondrous device do its job. This satisfying chicken chili made with broth and white beans instead of a tomato-base is no exception.",
        "description": "If you don’t have everything you need on hand, you can easily purchase all of the ingredients (just click the orange button below that says ‘Get Ingredients’). You can pick and choose exactly what ingredients you need based on what’s in your pantry and they’ll be on your doorstep before you know it. Unlike many slow-cooker white chicken chili recipes, this one doesn't even ask home cooks to sauté or brown the meat in advance. By setting the cooker to low, it slowly cooks the chicken and veggies until they’re just tender and after 8 hours of you living your life to the fullest, the meat will be ready to be gently shredded with a quick stir. The final result? A fragrant, spicy-meets-sweet (and most of all, comforting) chili that will warm you up from the inside out on the coldest days of the year. SWAP OPTION: Use Greek yogurt instead of sour cream for a lighter garnish. TECHNIQUE TIP: Short on time? Turn the slow-cooker up to ‘high’ and watch this chili come together in just four hours. Preheat the slow cooker on low heat for 30 minutes while prepping the vegetables. 2.Add the chicken to the slow cooker. Stir in the onion, celery, bell pepper, garlic, corn, beans, broth, salt, cumin, chili powder, oregano, thyme and black pepper. Cover and slow cook for 8 hours on low or 4 hours on high. Once cooked, stir to shred the tender chicken into bite-size pieces.3.For a creamier chili, stir in the sour cream just before serving, or serve as a topping with scallions if desired.",
        "image": "https://img.freepik.com/free-photo/tasty-baked-chicken-legs-with-spices-pan_1220-3194.jpg?t=st=1717423071~exp=1717426671~hmac=4acd3cd93da6b4a8a6029e3be4eb39c0345e89fef5d30d89d62f578fa88fd710&w=740"
    }
]